app/Views/Form/edit-user.php

SELECT *
FROM `login`
WHERE `user_id` = '5'
---
                                </div>
                            </div>

                            <?php $queryClass = $db->table('login')->getWhere(['user_id' => $usr['id']]);