app/Controllers/Admin.php

    public function index($links = false)
    {
        //Akses from side menu
        //======================
        if ($links) {
            switch ($links) {
                case "user":
                    // d($this->request->getVar('keyword'));
                    $user = $this->userModel->searchAdmin();
                    $title = "Admin List : All";

                    $currentPage = $this->request->getVar('page_user') ? $this->request->getVar('page_user') : 1;
                    $data = [
                        'title' => $title,
                        'user'  => $this->userModel->paginate(5, 'user'),
                        'pager' => $this->userModel->pager,
                        'currentPage' => $currentPage
                    ];
---
SELECT COUNT(*) AS `numrows`
FROM `user`

                    }

                    $currentPage = $this->request->getVar('page_soal') ? $this->request->getVar('page_soal') : 1;
                    $data = [
                        'title' => $title,
                        'soal'  => $this->soalModel->paginate(5, 'soal'),
                        'pager' => $this->soalModel->pager,
                        'currentPage' => $currentPage
                    ];
---
SELECT *
FROM `soal`
JOIN `kategori_soal` ON `soal`.`kategori_soal_id` = `kategori_soal`.`id`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `soal`
JOIN `kategori_soal` ON `soal`.`kategori_soal_id` = `kategori_soal`.`id`

    public function soal()
    {
        $keyword = $this->request->getVar('keyword');
        $user = $this->soalModel->searchSoal($keyword);
        if ($keyword) {
            $title = 'Soal Name Search : "' . $keyword . '"';
        } else {
            $title = 'Soal List : All';
        }
        $currentPage = $this->request->getVar('page_soal') ? $this->request->getVar('page_soal') : 1;
        $data = [
            'title' => $title,
            'soal'  => $this->soalModel->paginate(5, 'soal'),
            'pager' => $this->soalModel->pager,
            'currentPage' => $currentPage
        ];
---
SELECT *
FROM `soal`
JOIN `kategori_soal` ON `soal`.`kategori_soal_id` = `kategori_soal`.`id`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `soal`
JOIN `kategori_soal` ON `soal`.`kategori_soal_id` = `kategori_soal`.`id`