app/Controllers/Exercise.php

    public function soal()
    {
        $newTime = new Time('now', 'Asia/Jakarta');

        //for dashboard exercise
        $this->latihanModel->save([
            'date' => $newTime,
            'user_id' => session()->get('userID')
        ]);
        //ID terakhir yg di buat di tabel soal
        $db      = \Config\Database::connect();
        $latihanID = $db->insertID();
---
INSERT INTO `latihan` (`date`, `user_id`, `created_at`, `updated_at`) VALUES ('2022-04-25 11:40:22', '2', '2022-04-25 11:40:22', '2022-04-25 11:40:22')
INSERT INTO `latihan` (`date`, `created_at`, `updated_at`) VALUES ('2017-08-04 04:39:46', '2022-04-20 13:05:43', '2022-04-20 13:05:43')