app/Controllers/Latihan.php

UPDATE `latihan` SET `score` = 60, `benar` = 3, `salah` = 2, `updated_at` = '2022-04-22 04:36:46'
WHERE `latihan`.`id` IN (2)
---
            $score = $benar / $totalSoal * 100;

            $latihanID = session()->get('latihanID');
            $this->latihanModel->save([
                'id' => $latihanID,
                'score' => $score,
                'benar' => $benar,
                'salah' => $salah
            ]);