app/Controllers/Submit.php

UPDATE `user` SET `nim` = '0809809809', `updated_at` = '2022-04-08 06:31:33'
WHERE `user`.`id` IN (3)
---
            }
        } else {
            if ($statusID = 1) {
                $this->userModel->save([
                    'id' => $lastID,
                    'nim' => $this->request->getVar('nimnipUser')
                ]);