app/Controllers/Submit.php

INSERT INTO `soal` (`kategori_soal_id`, `name`, `is_picture`, `picture_url`, `is_audio`, `audio_url`, `is_choosen`, `created_at`, `updated_at`) VALUES ('2', '', NULL, NULL, NULL, NULL, NULL, '2022-04-13 12:01:52', '2022-04-13 12:01:52')
INSERT INTO `jawaban` (`soal_id`, `jawabanA`, `jawabanB`, `jawabanC`, `jawabanD`, `jawabanE`, `jawaban_benar`, `created_at`, `updated_at`) VALUES (2, NULL, NULL, NULL, NULL, NULL, '1', '2022-04-13 12:01:52', '2022-04-13 12:01:52')
---
    public function soal()
    {
        $isPicture = $this->request->getVar('isPicture');
        $fileGambar = $this->request->getVar('fileGambar');
        $isAudio = $this->request->getVar('isAudio');
        $fileAudio = $this->request->getVar('fileAudio');
        $isChoosen = $this->request->getVar('isChoosen');
        // d($this->request->getVar());

        $this->soalModel->save([
            'kategori_soal_id' => $this->request->getVar('kategoriSoal'),
            'name' => $this->request->getVar('isiSoal'),
            'is_picture' => $isPicture == "on" ? 1 : null,
            'picture_url' => $fileGambar,
            'is_audio' => $isAudio == "on" ? 1 : null,
            'audio_url' => $fileAudio,
            'is_choosen' => $isChoosen == "on" ? 1 : null
        ]);

        //ID terakhir yg di buat di tabel soal
        $db      = \Config\Database::connect();
        $lastID = $db->insertID();

        $this->soalModel->save([
            'id' => $lastID,
            'idx' => $lastID
        ]);

        $this->jawabanModel->save([
            'soal_id' => $lastID,
            'jawabanA' => $this->request->getVar('jawabanA') ? $this->request->getVar('jawabanA') : null,
            'jawabanB' => $this->request->getVar('jawabanB') ? $this->request->getVar('jawabanB') : null,
            'jawabanC' => $this->request->getVar('jawabanC') ? $this->request->getVar('jawabanC') : null,
            'jawabanD' => $this->request->getVar('jawabanD') ? $this->request->getVar('jawabanD') : null,
            'jawabanE' => $this->request->getVar('jawabanE') ? $this->request->getVar('jawabanE') : null,
            'jawaban_benar' => $this->request->getVar('jawabanBenar')
        ]);