app/Models/JawabanMDL.php

DELETE FROM `jawaban`
WHERE `id` IN ('9')
---
    public function delJawaban($id)
    {
        $this->delete(['soal_id' => $id]);