app/Models/LatihanMDL.php

SELECT *
FROM `latihan`
WHERE `user_id` = '1'
SELECT COUNT(*) AS `numrows` FROM `latihan`
---
    public function nilaiRatarata($id)
    {
        $this->where(['user_id' => $id]);
        $userID = $this->findAll();
        $bagi = $this->countAll();