app/Models/SoalMDL.php

DELETE FROM `soal`
WHERE `id` IN ('9')
---
    public function delSoal($id)
    {
        $this->delete(['id' => $id]);